package com.npfk.tasks.strings.level.easy.chapter1;

/** 1.4 Bonjour. Рядки 2.
 *
 * Думаю, з попередньої лекції тобі вже більш-менш стало зрозуміліше, що знаходиться всередині String`y. Це просто масив символів.
 *
 * В цій лекції ми продовжимо наше перше знайомство з цим типом даних,
 * і ти дізнаєшся, як дізнаватись розмір рядку. Поїхали;)
 *
 * Але, спочатку невеличка теорія-продовження попередньої теорії.
 *
 * Ітак, продовжуючи обговорення типу даних String, варто зазначити, одну досить цікаву штуку.
 * Цей тип даних насправді є класом. Так-так, класом. Давайте самі в цьому переконаємось.
 *
 * 1) В Java зазвичай всі класи пишуться з великою літери, це раз.
 * 2) Класи можна використовувати як типи даних, утворюючи екземпляри класу, це два.
 * (Екземпляр класу - це змінна, яка оголошена під типом цього класу. Ну наприклад:
 *  String name = "Alex"; - Зміна name є екземпляром класу String
 *  Scanner anyLine = new Scanner(System.in); - змінна anyLine є екземпляром класу Scanner)
 * 3) Класи, які використовуються як типи даних, не підсвічуються:)
 * (Самі переконайтесь у цьому. Наприклад, створіть змінну класу Scanner, BufferReader, InputStream...
 *  Всі ці класи використовуються як типи даних, але вони не підсвічуються, на відміну від примітивних типів даних) Це три.
 * 4) Будь-який клас може мати в собі методи, і доступ до цих методів отримає екземпляр класу (Тобто змінна з типом конкретного класу), це чотири.
 *
 * У тебе може виникнути таке запитаннячко: А що класи тут роблять? Це що, ООП?
 * Відповідь: Ні, це не ООП. Ми його тут не будемо чіпати, від слова, взагалі. Це особливості мови програмування Java,
 * Про які тобі варто розповісти, бо все, що буде далі, ти просто не зрозумієш.
 *
 *
 * P.S. І тим паче, ти вже знайомий з таким класом, як System, який тримає в собі методи println() та print();)
 *
 * =====================================================================================================================
 * Думаю, багато чого не зрозуміло, чи не так? Звикай. Зазвичай, ти дуже часто будеш чогось не розуміти в програмуванні.
 *                                   І ЦЕ АБСОЛЮТНО НОРМАЛЬНО!!!!
 *                      АБСОЛЮТНО ВСІ ПРОГРАМІСТИ ЧЕРЕЗ ЦЕ ПРОХОДИЛИ!!!!!
 *      Але, настане такий момент... Коли ти почнеш щось розуміти... Але до нього ще треба дійти:)
 * =====================================================================================================================
 *
 *
 * Думаю, щоб теорія дійсно була корисною, ми спробуємо використати її на практиці.
 * Значить, ми дізнались, що тип String - це насправді клас.
 *
 * І, думаю, ще з попередньої лекції, ти розумієш, що всередині цього класу String знаходиться той самий масив символів.
 * Так, замість того, щоб створювати кожен раз новий масив, ми просто використовуємо клас String, який має свій внутрішній масив.
 *
 * Так в чому ж особливість?
 * А в тому, що клас String, по-перше, це робить "правильніше", а по-друге, він пропонує нам додаткові методи
 * для роботи з цим масивом. Ці методи створили самі розробники класу String.
 *
 *
 * Давай домовимось так. Я тобі зараз дещо покажу, а ти маєш зробити точно те ж саме. Це буде дуже корисно для тебе.
 *
 * Створи у методі main змінну типу String з будь-якою назвою і надай її будь-яке значення.
 * Ну наприклад
 * String myName = "Alex";
 *
 * Тепер напиши в наступному рядку цю змінну і постав у її кінці крапку. Тобто
 * myName. <---- Ось тут є крапка
 * І у тебе вискочить менюшка. Це автодоповнення, яке пропонує тобі IDEA. І у цій менюшці ти побачиш... всі методи класу String.
 * Тобто, ти побачиш можеш побачити метод equals(), ти можеш побачити метод isEmpty(), length().
 * І ці методи, які для тебе створили розробники класу String, вже за тебе роблять брудну справу.
 * В інакшому випадку, тобі треба було б самому створювати ці методи;)
 *
 * Тобто, як ти розумієш, змінна myName має доступ до всіх методів класу String, оскільки вона є екземпляром цього класу.
 *
 * І так, у змінних з примітивним типом такої штуки немає;)
 * А тепер прибери ці 2 рядки коду.
 *
 * Сьогодні ми познайомимось з методом length() - який повертає кількість символів у рядку. Тобто, розмір рядка.
 *
 * Ітак... Ось тобі приклад коду...
 *
 * !!!!!!!!Будь ласка, запусти цей код у методі main()!!!!!!!
 * String aLotOfNumbers = "1231234321233224039832032443523443224432"; // Назва змінної дослівно перекладається як "Дуже багато цифр":)
 * int numberOfDigitsInLine = aLotOfNumbers.length(); // Назва змінної дослівно перекладається як "кількість цифр у рядку":)
 * System.out.println(numberOfDigits);
 * !!!!!!!!Будь ласка, запусти цей код у методі main()!!!!!!!
 *
 * А тепер невеличка гра "Фортуна удачі". Скільки цифр містить змінна aLotOfNumbers?:)
 * Варіанти відповідей: а) 50; б) 43; в) 40; д) 130; е) 68;
 *
 *
 * Або ось ще тобі приклад коду....
 *
 * !!!!!!!!Будь ласка, запусти цей код у методі main()!!!!!!!
 * String password = "8zMl1;,";
 * if (password.length() < 8) // Чи менше розмір паролю, аніж 8 символів?
 * {
 *      // Якщо так...
 *     System.out.println("Пароль занадто короткий!");
 * }
 * else if (password.length >= 8 && password.length <= 16)
 * {
 *     System.out.println("Нормальний пароль.");
 * }
 * else
 * {
 *      // Якщо ні...
 *     System.out.println("Пароль досить надійний");
 * }
 * !!!!!!!!Будь ласка, запусти цей код у методі main()!!!!!!!
 *
 *
 * Ну, добренько. Ось тобі ще одне завдання, і на цьому ми завершуємо першу частину модуля Easy;)
 *
 * Завдання...
 *
 * Умови:
 * У методі main() створи три змінні типу String, і надай їм БУДЬ-ЯКЕ значення, головне, щоб кількість символів була ДУЖЕ великою.
 * Можеш кожній змінні надати якусь абра-кадабру:)
 * І створи змінну типу int яка підсумовує кількість символів у всіх трьох зміннах.
 *
 * Приклад значень змінн:
 * String one = "aoi0iufsdiudwqiuhdu\aodjdsaoiaiudhsisajdhaiudshdiuahueiwh82r30uwhodsjfdsoifdsffas";
 * String second = "21312311334279243984273wreouidsujffsojoiajfdu8uf94-d3wuufdsuhoiufsdp29348ueiwq-12ewq";
 * String third = "049njdnfsjdzkm,kmijpioj99yu9ryy92eioadjsidaih328yew9qd8sayhfdcfdhj             ";
 *
 * І виведи цю суму чисел на екран:)
 */



public class Lesson4
{
    public static void main(String[] args)
    {
        // Напиши код тут.
    }

}
