package com.npfk.tasks.strings.level.easy.chapter1;


/** 1.1 Bonjour. Це ваше перше завдання:)
 *
 * Гаразд, давайте тут ми познайомимось з такими штуками, як вивід інформації.
 * Зазвичай, щоб вивести будь-яку інформацію у консоль в мові програмування Java,
 * нам треба звернутись до такого класу, як System.out .
 * Він пропонує нам різноманітні методи, які можуть виводити інформацію у консоль.
 * А саме, такими методмаи є println(), print(), printf().
 *
 * Але, розбиратись подетально, чим ці методи відрізняються, ми не будемо. І в цьому немає сенсу;)
 * Ви скоро самі побачите різницю між ними.
 * Спойлер: У майбутньому вам знадобляться методи println() і print() для вирішення досить складного завдання:)
 *
 * Добренько, давайте просто виведемо на екран ваше перше повідомлення. Ваша задача:
 * Привітайся зі світом:) Покажи світу, що ти є. Скажи йому "Привіт"
 * Але, зроби це досить незвичайним способом.
 *
 * Умова:
 * Виведи спочатку Hello
 * А потім         World!
 *
 * Щоб вивести на екран будь-яке повідомлення, використай метод println() з класу System.out
 * Саме повідомлення поклади у лапки (Це означатиме, що ти створюєш текстовий рядок) Тобто:
 * System.out.println("Hello");
 * System.out.println("World!");
 * Як результат, коли ти запустиш програму, у консолі відобразиться твоє повідомлення світу;)
 *
 * Вивід:
 * Hello
 * World!
 *
 *
 * Невеличка порада у роботі з середовищем розробки IDEA:
 * Писати оцей от System.out.println() це досить довго і нудно? Розробники IDEA також так думали, і тому, вони зробили
 * невеличкий бінд. Замість цього напиши просто sout і потім натисни на клавішу TAB. IDEA на місці бінду замінить його на оцей
 * System.out.println(). Нічого особистого, просто магія:)
 */
public class Lesson1
{
    public static void main(String[] args)
    {
        // Напиши код тут.
    }
}
